Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the entire ocean of the assemblies of bodhisattva followers of those buddha bhagavats.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཐོག་མ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the first development of roots of merit by those bodhisattvas.

source: །ཐོག་མ་སེམས་བསྐྱེད་པའི་སྨོན་ལམ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know their first development of the aspiration to enlightenment.

source: །སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know their different prayers.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་འབྱུང་བའི་རྒྱན་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་རྣམ་པ་ཐ་དད་པ་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of their accomplishment of the displays of setting forth through bodhisattva conduct.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་གྱི་ཡན་ལག་གི་ཚོགས་རྣམ་པར་དག་པར་བྱ་བ་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of their pure accumulation of the aspect of the path of the perfections.

source: །བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་ནན་ཏན་དུ་བྱ་བའི་རྒྱན་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of their display of practicing the bodhisattva path.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་ཚོགས་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of their accumulations of ascending the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་ཤུགས་དྲག་པོ་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of the strong powers of ascending the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་བཟེམ་པའི་མཐུ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of the fields of samādhis that have the power to cause one to progress through the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོད་པས་རྣམ་པར་རྩེ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the miraculous displays on ascending the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་རྣམ་པར་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the conduct on ascending the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་རབ་ཏུ་གནས་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know being established on the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་བསྒོམ་པའི་རྒྱུད་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the continuous meditation on the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་སྦྱང་བའི་ཚུལ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the ways of purification on the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་ཡང་དག་པར་གནས་པར་བྱ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know dwelling on the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་སའི་མཚན་མ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the characteristics of the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་སའི་དབང་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the powers of the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ནས་སར་འཕར་བའི་ཡེ་ཤེས་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the wisdoms that cause ascent through the bodhisattva bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་བསྡུ་བའི་ཡེ་ཤེས་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པ་ལ་ཡང་དག་པར་གནས་པར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the wisdom that gathers together the bodhisattva bhūmis. I know the wisdom that ripens the bodhisattva bhūmis. I know the established states of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་གྱི་རྒྱ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the vast field of conduct of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྣམ་པར་བརྩེ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the miraculous displays of the conduct of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the oceans of the samādhis of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the oceans of the liberations of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་སྣ་ཚོགས་ཐོབ་པར་བྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the attainment by bodhisattvas of various samādhis in each instant of mind.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྣང་བའི་ཚུལ་ཐོབ་པར་བྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know their attainments of the ways of the illumination of omniscience.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གློག་གི་སྣང་བའི་སྤྲིན་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the clouds of light from the lightning of omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐོབ་པའི་ཚུལ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the ways of the attainment of the patience of bodhisattvas.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the prowess of immersion in omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཞིང་རྒྱ་མཚོར་རྗེས་སུ་བགྲོད་པར་བྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the proceeding to oceans of realms by bodhisattvas.

source: །ཆོས་རྒྱ་མཚོའི་ཚུལ་ལ་འཇུག་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know their entry into an ocean of the ways of the Dharma.

source: །སེམས་ཅན་རྒྱ་མཚོའི་མཚན་ཉིད་ཐ་དད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the different characteristics of an ocean of beings.

source: །བྱང་ཆུབ་སེམས་དཔའི་དམ་པར་སྤྱོད་པའི་ཚུལ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the miraculous manifestations of all the ways of the conduct of bodhisattvas.

source: །སྨོན་ལམ་གྱི་ཚུལ་སྣ་ཚོགས་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the oceans of the various ways of their prayers.

source: །རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་རྒྱ་མཚོ་རྣམ་པ་ཐ་དད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the different forms of the ocean of their various miraculous manifestations.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ཇི་ལྟར་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་འདས་པ་དང་། ད་ལྟར་བྱུང་བའི་བསྐལ་པ་སྣ་ཚོགས་རྒྱ་མཚོ་ལ་ཞུགས་ཏེ། ཁོང་དུ་ཆུད་པ་དེ་བཞིན་དུ་ཕྱི་མའི་མཐའ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དེ། རྒྱུན་མི་འཆད་པའི་མ་འོངས་པའི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “Noble one, in the same way that I know and comprehend the ocean of various kalpas in this Sahā realm in the past and in the present, I also know the ocean of the continuous succession of future kalpas.

source: །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་བ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “In the same way that I know the ocean of kalpas of the entire succession of world realms that are contained within the Sahā world realm, I also know the ocean of kalpas of the entire succession of world realms contained within the atoms of the Sahā world realm.

source: །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཁོངས་སུ་ཆུད་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་རྣམས་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “In the same way that I know the ocean of kalpas of the entire succession of world realms contained within the atoms of the Sahā world realm, I also know the ocean of kalpas of all the world realms that surround the Sahā world realm in the ten directions.

source: །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་རྣམས་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དག་ན་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་བརྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “In the same way that I know the ocean of kalpas of all the world realms that surround the Sahā world realm in the ten directions, I also know the ocean of kalpas of all the successive world realms present in all the world realms that surround the Sahā world realm in the ten directions.

source: །མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གནས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་རྣམས་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུ་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “In the same way that I know the ocean of kalpas of all the successive world realms present in the world realms that surround the Sahā world realm in the ten directions, I also know the ocean of kalpas of all the world realms contained within the family of the Prabhāsa­vairocana world realms in all the ten directions.

source: །ཕྱོགས་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དུ་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་ཇི་ལྟར་ཤེས་པ་དེ་བཞིན་དུ་ཕྱོགས་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དག་ལ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་རྣམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “In the same way that I know the ocean of kalpas of all the world realms contained within the family of the Prabhāsa­vairocana world realms in all the ten directions, I also know the ocean of kalpas of all the successive world realms present in all the world realms that surround in the ten directions the family of the Prabhāsa­vairocana world realms.

source: །ཕྱོགས་ཀུན་ཏུ་འོད་རྣམ་པར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཕྱོགས་བཅུར་འདབ་ཆགས་སུ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དག་ལ་གནས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསྐལ་བ་རྒྱ་མཚོ་རྣམས་རབ་ཏུ་ཤེས་པ་དེ་བཞིན་དུ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་འདིར་གཏོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་རྣམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “In the same way that I know the ocean of kalpas of all the successive world realms present in all the world realms that surround in the ten directions the family of the Prabhāsa­vairocana world realms, I also know the ocean of kalpas in the vast extent of the world realms contained in this ocean of world realms, Kusuma­tala­garbha­vyūhālaṃkāra.

source: །དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཚུལ་དུ་བྱ་བ་རྣམས་དང་། དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་ལོ་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དཀྱིལ་འཁོར་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བྱེ་བྲག་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཆུ་ཀླུང་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གློང་རྣམས་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འཁྱིལ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རི་རབ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འབྱུང་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་པདྨོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སྡོང་པོ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྟ་བགབ་དང་། འཇིག་རྟེན་གྱི་མྱིང་དུ་བྱ་བ་རྣམས་ཀྱི་བསྐལ་པ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པ།
en: “In the same way, I know the ocean of kalpas in the ways of the world realms, in the circles of the world realms, in the field of the world realms, in the categories of the world realms, in the rivers of the world realms, in the vortexes of the world realms, in the revolving of the world realms, in the Sumerus of the world realms, in the arising of the world realms, in the lotuses of the world realms, in the trees of the world realms, in the toraṇas of the world realms, and in the naming of the world realms.

source: འདི་ཇི་ལྟར་ཤེས་པར་གྱུར་པ་དེ་བཞིན་དུ། ཕྱོགས་བཅུ་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པ་དག་གི་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །རྗེས་སུ་དྲན་ནོ།
en: “In the same way that I know the Kusuma­tala­garbha­vyūhālaṃkāra ocean of world realms, I also know and remember the ocean of prayers made in the past by the Bhagavat Vairocana in the endless, limitless ocean of world realms in the ten directions throughout the extent of the realm of phenomena, up to the ends of space.

source: །སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་དག་ལའང་ཤེས་ཤིང་། ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the oceans of his past activities.

source: །སྔོན་ཡོངས་སུ་བསྒྲུབས་པའི་ཚུལ་རྒྱ་མཚོ་དག་ལའང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I know and comprehend the oceans of his past accomplishments.

source: །བསྐལ་པ་མཐའ་དང་དབུས་མེད་པར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་ལ་ཡང་དག་པར་བཞུགས་པ་མཛད་པ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his continuing in bodhisattva conduct during kalpas without end or middle.

source: །ཞིང་ཡོངས་སུ་དག་པར་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his ways of purifying realms.

source: །སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་མཛད་པའི་ཐབས་ཀྱི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ways of his methods for ripening beings.

source: །སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་བསྙེན་བཀུར་མཛད་ཅིང་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་བ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his miraculous manifestations of going to the past tathāgatas and serving them.

source: །སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོར་མཛད་པའི་སྦྱོར་བའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his engagement in venerating and making offerings to the past tathāgatas.

source: །སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དག་གིས་ཆོས་བསྟན་པ་ཡོངས་སུ་བཟུང་བའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his ways of obtaining the Dharma teachings of the past tathāgatas.

source: །སྔོན་བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་རབ་ཏུ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །ཡོ་བྱད་ལ་དབང་བསྒྱུར་བ་རབ་ཏུ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ways of his attainment of bodhisattva samādhis.

source: །སྔོན་གྱི་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་ནན་ཏན་ཏུ་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ways of his practicing the ocean of the qualities of the past tathāgatas.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the oceans of his ways of the perfection of generosity.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་མངོན་པར་བསྒྲུབ་པ་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ways of his accomplishment of the pure field of disciplines and the correct conduct of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ways of his attainment of bodhisattva patience.

source: །བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་དྲག་པོ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of his powerful bodhisattva diligence.

source: །བསམ་གཏན་གྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of his perfecting the aspects of dhyāna.

source: །ཤེས་རབ་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པར་མཛད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of his ways of purifying the field of wisdom.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྐྱེ་གནས་ཐམས་ཅད་དུ་སྐུའི་གཟུགས་བརྙན་ཡོངས་སུ་བསྟན་པ་མཛད་པའི་ཐབས་ཀྱི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his ways of methods in manifesting the images of his body through births in all the world realms.

source: །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཡོངས་ས་དག་པར་མཛད་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his ways of purifying the field of the completely good conduct and prayer.

source: །ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་རྒྱས་པར་མཛད་པ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his spreading through the ocean of realms.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་མཛད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་། ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of his ways of purifying all buddha realms.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལས་ཡེ་ཤེས་སྣང་བར་གྱུར་པ། རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the illumination of wisdom from all the tathāgatas.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་གནས་པ་མཛད་པའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the miraculous manifestations of reaching the enlightenment of all buddhas.

source: །དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་བརྙེས་པའི་ཚུལ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend his ways of attaining the illumination of the wisdom of all the tathāgatas.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཞུགས་ཏེ་ཐུགས་སུ་ཆུད་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of his ways of comprehending the realization of omniscience.

source: །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the miraculous manifestation of the attainment of complete buddhahood.

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་དང་རྣམ་པར་རོལ་བའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ways of displaying and the power of supremacy in turning the wheel of the Dharma.

source: །འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the field of saṃsāra.

source: །འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the past roots of merit of all bodhisattvas in the field of saṃsāra.

source: །ཐོག་མའི་སྨོན་ལམ་གྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of initial prayers.

source: །སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱེད་པ་དང་། གདུལ་བའི་ཐབས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of the methods for ripening and guiding beings.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ། སེམས་ཅན་རྒྱ་མཚོ་ཡོངས་སུ་སྨྱིན་པར་མཛད་པ་དེ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the Bhagavat’s ripening of an ocean of beings when he was practicing bodhisattva conduct in the past.

source: །སེམས་ཅན་དེ་དག་གི་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེའི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བའི་ཐབས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of methods that increase the roots of merit of those beings in each instant of their minds.

source: །ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of the attainment of samādhi.

source: །གཟུངས་ཀྱི་སྒོ་རབ་ཏུ་ཐོབ་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of the attainment of the power of mental retention.

source: །སྤོབས་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of the pure field of the wisdom of eloquence.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་གནོན་པའི་རྣམ་པར་འཕྲུལ་བའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of the miraculous manifestations of ascending all the bodhisattva bhūmis.

source: །སྤྱོད་པའི་དྲ་བ་མངོན་པར་བསྒྲུབ་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of accomplishing the net of conduct.

source: །མཐར་གྱིས་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱོགས་པ་ལ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of the ways of the wisdom that enters the direction of final accomplishment.

source: །དེ་དག་གི་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དག་ཀྱང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I also know and comprehend the ocean of his miraculous manifestations of the powers, strengths, aspects of enlightenment, dhyānas, liberations, samādhis, and samāpattis.

source: །ཇི་ལྟར་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་བྱུང་བ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དེ། མངོན་པར་བསྒྲུབས་པ་དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་དང་། ཡེ་ཤེས་ཀྱི་སྒྱུ་མའི་དྲ་བ་མཐའ་ཡས་པ་ལ་འཇུག་པ། ཆོས་ཀྱི་དབྱིངས་མཐའ་ཡས་པ་རྒྱས་པར་འགེངས་པ། སྒོ་མཐའ་ཡས་པ་ནས་ཤིན་ཏུ་བསྟན་པར་བྱ་བ། ཕྱི་མའི་མཐའི་བསྐལ་པར་གནས་པ་ལ་འཇིག་པས་བསྟན་པར་བྱ་བ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཀླས་པ། ནམ་མཁའི་མཐས་གཏུགས་པར་བྱུང་བ་ཐམས་ཅད་ཀྱང་མ་འདྲེས་པར་ཤེས་ཤིང་། ཁོང་དུ་ཆུད་དེ་མངོན་པར་སྒྲུབ་བོ།
en: “In the same way that I realize, know, and comprehend the ocean of the Bhagavat Vairocana’s buddha and bodhisattva conduct throughout the entire realm of phenomena, I also realize, know, and comprehend the ocean of buddha and bodhisattva conduct of all the tathāgatas and their entry into the infinite illusory net of wisdom, their pervasion of the infinite realm of phenomena, their teaching of infinite entrances, and their teaching through entering into remaining until the last of future kalpas, which appear distinctly within the ocean of the world realms of the ten directions, throughout the realm of phenomena up to the ends of space.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་བལྟ་བའི་ཡུལ་གྱི་ཡུལ་ནི་དེ་ལྟ་བུ་སྟེ།
en: Noble one, it is because this purview is that of the bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas

source: དེའི་ཕྱིར་དེ་ལ་སྙོམས་པར་ཞུགས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པའི་ཚུལ་རབ་ཏུ་ཤེས་སོ།
en: When I am resting in that, I know the minds and conduct of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་ཚོགས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “I know the accumulation of good actions of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the defilement and the purification of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the various kinds of karma of all beings.

source: །ཉན་ཐོས་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the entrances to samādhi of all śrāvakas.

source: །ཉན་ཐོས་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ས་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the levels of samādhi of all śrāvakas.

source: །རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པ་ཞི་བས་རྣམ་པར་འཕྲུལ་པ་ཡང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ།
en: I know and comprehend the miraculous manifestation through the peace of the liberations of all pratyeka­buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་ཚུལ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know the ways of the ocean of samādhis of all bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the ways of the ocean of the liberations of all bodhisattvas.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I know the entry into the ocean of the liberations of all the tathāgatas.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཤཱཀྱའི་བུ་མོ་གོ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་འདི་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: Then Sudhana, the head merchant’s son, asked the Śākya maiden Gopā, “Āryā, how long has it been since you attained this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas

source: སྨྲས་པ། རིགས་ཀྱི་བུ། སྔོན་འདས་པའི་དུས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པ་འདས་པའི་ཕ་རོལ་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་མི་འཇིགས་པ་བྱེད་པ་ཞེས་བྱ་བ་བྱུང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས།
en: She answered, “Noble one, in the past, in times gone by, beyond as many kalpas as there are atoms in a hundred buddha realms, there was a world realm called Abhayaṃkarā.

source: དེའི་བསྐལ་པ་འགྲོ་བའི་མཆོག་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: In that world there was a kalpa called Gatipravara.
